In [8]:
import pandas as pd
import numpy as np
df=pd.read_excel(r"W:\JupyterWS\Files\file_example_10.xls")
df

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [12]:
df_age = pd.DataFrame(df, columns= ['Age'])

In [13]:
df_age.sum()

Age    323
dtype: int64

In [14]:
df_age.sum()

Age    323
dtype: int64

In [15]:
df_age.mean()

Age    35.888889
dtype: float64

In [18]:
df_age.median()

Age    32.0
dtype: float64

In [19]:
df_age.mode()

   Age
0   25

In [20]:
df_age.min()

Age    24
dtype: int64

In [21]:
df_age.max()

Age    58
dtype: int64

In [22]:
df_age.abs()

   Age
0   32
1   25
2   36
3   25
4   58
5   24
6   56
7   27
8   40

In [16]:
df_age.std()

Age    13.147666
dtype: float64

In [17]:
df_age.count()

Age    9
dtype: int64

In [27]:
df_age.abs()

   Age
0   32
1   25
2   36
3   25
4   58
5   24
6   56
7   27
8   40

In [28]:
df_age.prod()

Age    60615475200000
dtype: int64

In [29]:
df_age.div(2)

    Age
0  16.0
1  12.5
2  18.0
3  12.5
4  29.0
5  12.0
6  28.0
7  13.5
8  20.0

In [30]:
df_age.add(5)

   Age
0   37
1   30
2   41
3   30
4   63
5   29
6   61
7   32
8   45

In [33]:
df_age.cumsum()

   Age
0   32
1   57
2   93
3  118
4  176
5  200
6  256
7  283
8  323

In [34]:
df_age.cumsum()

   Age
0   32
1   57
2   93
3  118
4  176
5  200
6  256
7  283
8  323

In [39]:
df_age.count()

Age    9
dtype: int64

In [44]:
df_age.corr()

     Age
Age  1.0